[
  {
    "blogPost": "New Learnings, Certifications & Apple Retail Sales Data Pipeline — dbt + DuckDB Medallion Architecture",
    "explanation": "Currently implementing an end-to-end data transformation pipeline using <span style='color: #437fc7'>dbt</span> and <span style='color: #437fc7'>DuckDB</span> for Apple’s retail sales data. The project follows the <span style='color: #437fc7'>Medallion Architecture</span> (Bronze, Silver, Gold) approach. It involves building modular SQL models for cleaning, joining, and aggregating sales data, applying tests for data quality, and documenting the lineage in dbt docs. DuckDB serves as the local analytical engine for development and testing, enabling lightweight yet powerful analytics workflows. This project strengthens understanding of modern data stack tools, incremental models, and best practices in data transformation.\n\nRecently achieved the <span style='color: #437fc7'>Tableau Desktop Specialist</span> certification, validating strong visualization and dashboarding skills. Currently pursuing <span style='color: #437fc7'>AWS Cloud Practitioner</span> and <span style='color: #437fc7'>DataBricks Data Engineering Associate</span> certifications to deepen cloud analytics expertise. These certifications align with the goal of mastering data engineering and analytics across <span style='color: #437fc7'>cloud platforms</span> and <span style='color: #437fc7'>modern data pipelines</span>.\n\nCurrently advancing my expertise in <span style='color: #437fc7'>Advanced Analytics</span> to deepen understanding of <span style='color: #437fc7'>statistical modeling</span>, <span style='color: #437fc7'>feature engineering</span>, and <span style='color: #437fc7'>predictive insights</span> — bridging the gap between <span style='color: #437fc7'>data storytelling</span> and <span style='color: #437fc7'>machine learning</span>-driven decision making."
  },
  {
    "blogPost": "Data Insights Portfolio — EV Market & Job Market Dashboards",
    "explanation": "Combined analytics from two major projects: <span style='color: #437fc7'>Electric Vehicle Market Analysis</span> and <span style='color: #437fc7'>The Data Job Market Dashboard</span>. These works showcase the ability to transform complex datasets into actionable insights across sustainability and career intelligence domains.\n\nIn the <span style='color: #437fc7'>EV Market Analysis</span>, explored the global rise of <span style='color: #437fc7'>Electric Vehicles (EVs)</span> vs <span style='color: #437fc7'>Plug-in Hybrid Electric Vehicles (PHEVs)</span> using <span style='color: #437fc7'>Python (Pandas)</span> and <span style='color: #437fc7'>Tableau</span>. Uncovered trends in <span style='color: #437fc7'>EV vs PHEV market share</span>, <span style='color: #437fc7'>MSRP segmentation</span>, and <span style='color: #437fc7'>Tesla’s performance</span> across adoption regions.\n\nMeanwhile, the <span style='color: #437fc7'>Data Job Market Dashboard</span> analyzed thousands of Canadian data roles to correlate <span style='color: #437fc7'>skills</span>, <span style='color: #437fc7'>experience</span>, and <span style='color: #437fc7'>pay range</span>. Built using <span style='color: #437fc7'>Python</span>, <span style='color: #437fc7'>SQL</span>, <span style='color: #437fc7'>dbt</span>, and <span style='color: #437fc7'>Tableau</span>, this dashboard revealed demand clusters and high-value skill intersections.\n\nLearnings: Strengthened expertise in <span style='color: #437fc7'>end-to-end analytics pipelines</span>, refined <span style='color: #437fc7'>data storytelling</span> across technical and environmental contexts, and gained deep insight into how <span style='color: #437fc7'>data visualization</span> drives both sustainability and workforce decisions."
  }
]
